In [1]:
import pandas as pd

In [4]:
df = pd.read_excel('temp.xlsx')

In [5]:
df

   name  age    sal
0   xyh   56  15687
1  bfjd   53  36584
2   nkd   24   2535

In [8]:
df2 = pd.read_excel('temp.xlsx',sheet_name='product')

In [9]:
df2

  product name    qty
0         vdhs  41545
1        htsjr    156
2          rjy   6551
3        skudt   8561
4         jdbg   5616

In [10]:
df2.to_html('temp.html')

In [13]:
df2.to_numpy()

array([['vdhs', 41545],
       ['htsjr', 156],
       ['rjy', 6551],
       ['skudt', 8561],
       ['jdbg', 5616]], dtype=object)

In [14]:
df4=pd.read_html('https://en.wikipedia.org/wiki/COVID-19_pandemic_by_country_and_territory')

In [17]:
df4[12]

,Unnamed: 0,Country,Deaths / million,Deaths,Cases
0,NaN,World[a],832,6583938,628979556
1,NaN,Peru,6432,216884,4153605
2,NaN,Bulgaria,5497,37853,1276765
3,NaN,Bosnia and Herzegovina,4943,16169,399811
4,NaN,Hungary,4937,47938,2141513
...,...,...,...,...,...
216,NaN,Falkland Islands,—,—,1930
217,NaN,Vatican City,—,0,29
218,NaN,"Saint Helena, Ascension and Tristan da Cunha",—,—,2032
219,NaN,Tuvalu,—,—,23
220,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...,.mw-parser-output .reflist{font-size:90%;margi...

In [20]:
py_dict = {
    'name':['a','b','c'],
    'age':[23,45,67],
    'id':[56,55,55]
}

In [21]:
df5=pd.DataFrame(py_dict)

In [22]:
df5

  name  age  id
0    a   23  56
1    b   45  55
2    c   67  55

NameError: name 'df4' is not defined